Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source2.tmx
Source language: en_us
Languages: ja

source: See also: LazySequenceProtocol, LazyCollection
ja: 参照：LazySequenceProtocol、LazyCollection

source: See also: elements
ja: 参照：elements

source: See the children property for details.
ja: childrenプロパティを詳細として見てください。

source: See those types for more information.
ja: さらなる情報としてそれらの型を見てください。

source: Selecting Elements
ja: 要素の選択

source: Sequence Implementations
ja: Sequence 実装

source: Sequence and Collection Operations
ja: シーケンスおよびコレクション演算

source: Sequence and Collection Protocols
ja: シーケンスおよびコレクションプロトコル

source: Sequence operations that take closure arguments, such as map(_:) and filter(_:), are normally eager: They use the closure immediately and return a new array.
ja: クロージャ引数をとるシーケンス演算、たとえばmap(_:)およびfilter(_:)は、通常は先行です；それらはクロージャを直ちに使います、そして新しい配列を返します。

source: Sequences provide access to their elements by creating an iterator, which keeps track of its iteration process and returns one element at a time as it advances through the sequence.
ja: さまざまなシーケンスは、あるイテレータを作成することによってそれらの要素に対するアクセスを提供します、それはそれの反復処理を追跡し続けてそれがそのシーケンスを始めから終わりへと前進するごとに一度に１つ要素を返します。

source: Set A is a strict subset of another set B if every member of A is also a member of B and B contains at least one element that is not a member of A.
ja: 集合Aがもう１つの集合Bの狭義の部分集合であるのは、AのすべてのメンバがまたBのメンバであり、Bが少なくとも１つのAのメンバではない要素を含む場合です。

source: Set A is a strict superset of another set B if every member of B is also a member of A and A contains at least one element that is not a member of B.
ja: 集合Aがもう１つの集合Bの狭義の上位集合であるのは、BのすべてのメンバがまたAのメンバであり、Aが少なくとも１つのBのメンバではない要素を含む場合です。

source: Set A is a subset of another set B if every member of A is also a member of B.
ja: 集合Aがもう１つの集合Bの狭義の部分集合であるのは、AのすべてのメンバがまたBのメンバである場合です。

source: Set A is a superset of another set B if every member of B is also a member of A.
ja: 集合Aがもう１つの集合Bの狭義の上位集合であるのは、BのすべてのメンバがまたAのメンバである場合です。

source: Set Operations
ja: 集合演算

source: Set operations are not limited to use with other sets.
ja: 集合演算は、他の集合との使用に制限されません。

source: SetAlgebra Implementations
ja: 集合代数実装

source: Sets
ja: 集合

source: Sets provide a suite of mathematical set operations.
ja: 集合は、数学的な集合演算のひとそろいを提供します。

source: Shuffles the collection in place, using the given generator as a source for randomness.
ja: コレクションをその場で混ぜ合わせます、与えられた生成子を無作為さの出典として使います。

source: Shuffles the collection in place.
ja: コレクションをその場で混ぜ合わせます。

source: Signed Integers
ja: 符号付き整数

source: Similar to the reduce(_:_:) method defined in the standard library, which takes an initial value and a combining closure, reduce1(_:) uses the first element of the sequence as the initial value.
ja: 初期値と結合クロージャをとる、標準ライブラリ定義のreduce(_:_:)メソッドとよく似て、 reduce1(_:)はシーケンスの最初の要素を初期値として使います。

source: Similarly, you use the availability condition #available to execute code conditionally based on required platform and version conditions.
ja: 同様に、あなたは利用可能性条件#availableを使うことで、必要なプラットホームおよびバージョン条件に基づいて、条件付きでコードを実行します。

source: Simply assign an array literal to a variable or constant with the Set type specified.
ja: 単にある配列リテラルをSet型指定子を持つ変数または定数に代入してください。

source: Some algorithms, however, may call for direct iterator use.
ja: 幾つかのアルゴリズムは、しかしながら、直にイテレータを使うために呼び出すかもしれません。

source: Some operations that are efficient on a dictionary are slower when using KeyValuePairs.
ja: 辞書に効率の良いいくつかの演算は、KeyValuePairsを使う場合により遅くなります。

source: Sometimes you need to preserve the entire result of a function call or other expression that can either throw or return a value.
ja: 時々あなたはスローするまたは値を返すどちらかが可能な関数呼び出しや他の式の結果の全体を保全する必要があります。

source: Sorting Elements
ja: 要素のソート（並べ換え）

source: Sorts the collection in place, using the given predicate as the comparison between elements.
ja: コレクションをその場でソートします、与えられた述部を要素間の比較として使います。

source: Sorts the collection in place.
ja: コレクションをその場でソートします。

source: Special-Use Collections
ja: 特殊用途のコレクション

source: Special-Use Numeric Types
ja: 特殊用途の数値型

source: Splitting and Joining Elements
ja: 要素の分割と連結

source: Storage for a vector of 16 integers.
ja: 16整数のベクターに対するストレージ。

source: Storage for a vector of 32 integers.
ja: 32整数のベクターに対するストレージ。

source: Storage for a vector of 64 integers.
ja: 64整数のベクターに対するストレージ。

source: Storage for a vector of eight integers.
ja: ８整数のベクターに対するストレージ。

source: Storage for a vector of four integers.
ja: 4整数のベクターに対するストレージ。

source: Storage for a vector of two integers.
ja: ２整数のベクターに対するストレージ。

source: Stores a keyed encoding container for the given key and returns it.
ja: キー付けされたエンコーディングコンテナを指定キーに対して供給して、それを返します。

source: Stores a new nested container for the default super key and returns a new encoder instance for encoding super into that container.
ja: 新しい入れ子コンテナを省略時のsuperキーに対して格納します、そしてsuperをそのコンテナへとエンコードするための新しいエンコーダインスタンスを返します。

source: Stores a new nested container for the given key and returns a new encoder instance for encoding super into that container.
ja: 新しい入れ子のコンテナをこの与えられたキーに対して格納します、そしてsuperそのコンテナへとエンコードするための新しいエンコーダインスタンスを返します。

source: Stores an unkeyed encoding container for the given key and returns it.
ja: キー付けされないエンコーディングコンテナを指定キーに対して供給して、それを返します。

source: Stores the result of performing a bitwise AND operation on the two given values in the left-hand-side variable.
ja: ビット単位AND演算を２つの与えられた値に関して実行する結果を左手側の変数に格納します。

source: Stores the result of performing a bitwise OR operation on the two given values in the left-hand-side variable.
ja: ビット単位OR演算を２つの与えられた値に関して実行する結果を左手側の変数に格納します。

source: Stores the result of performing a bitwise XOR operation on the two given values in the left-hand-side variable.
ja: ビット単位XOR演算を２つの与えられた値に関して実行する結果を左手側の変数に格納します。

source: Stores the result of shifting a value’s binary representation the specified number of digits to the left in the left-hand-side variable.
ja: ある値のバイナリ表現を指定された桁数だけ左にシフトする結果を左手側の変数に格納します。

source: Stores the result of shifting a value’s binary representation the specified number of digits to the right in the left-hand-side variable.
ja: ある値のバイナリ表現を指定された桁数だけ右にシフトする結果を左手側の変数に格納します。

source: String Representation
ja: 文字列表現

source: Strings in Swift conform to the Comparable protocol, so the names are sorted in ascending order according to the less-than operator (<).
ja: 文字列はSwift ではComparableプロトコルに準拠します、それでこれらの名前はより小さい演算子（<）によって昇順にソートされます。

source: Structures
ja: 構造体

source: Structures in Swift can declare methods, property accessors, and initializers.
ja: Swiftでの構造体は、メソッド、プロパティアクセッサ、そしてイニシャライザを宣言できます。

source: Subclasses must not have any stored properties; any storage needed should be included in Header.
ja: サブクラスは、どんな保存プロパティも持つ必要はありません；必要とされるあらゆるストレージはHeaderの中に含められるべきです。

source: Subscripts
ja: 添え字

source: Subtracts one value from another and produces their difference.
ja: ある値をもう一方から減じて、それらの差を返します。

source: Subtracts the second value from the first and stores the difference in the left-hand-side variable, wrapping any overflow.
ja: ２番目の値を最初のものから減じてその差を左手側の変数の中に格納します、あらゆるオーバーフローをラップします。

source: Subtracts the second value from the first and stores the difference in the left-hand-side variable.
ja: ２番目の値を最初のものから減じて、その差を左手側の変数の中に格納します。

source: Supporting Types
ja: 支援を行う型

source: Suppresses the representation of all ancestor classes.
ja: 全ての先祖クラスの表現を抑制します。

source: Swift Standard Library
ja: Swift標準ライブラリ

source: Swift imports each object instance parameter, return value, and property as an implicitly wrapped optional:
ja: Swiftは、オブジェクトインスタンスパラメータ、戻り値、そしてプロパティそれぞれを暗黙的にラップされたオプショナルとしてインポートします：

source: Swift imports the type the same way as in the previous section.
ja: Swiftは、その型を以前の節と同じ方法でインポートします。

source: Swift makes it as easy to create a new set as to create a new array.
ja: Swiftは、新しい集合を作成することを新しい配列を作成するのと同じくらい簡単にします。

source: Swift uses a sequence’s or collection’s iterator internally to enable the for-in loop language construct.
ja: Swiftは、あるシーケンスのもつまたはコレクションのもつイテレータを内部的に使うことで、for-inループ言語構成体を可能にしています。

source: Swift’s type system usually shows the wrapped type’s name with a trailing question mark (?) instead of showing the full type name.
ja: Swiftのもつ型システムは通常、ラップされた型のもつ名前を後に続く疑問符（?）で示します、完全な型の名前を示す代わりに。

source: Testing for Membership
ja: 帰属をテストする

source: That is, for a mutable collection instance a, index i, and value x, the two sets of assignments in the following code sample must be equivalent:
ja: すなわち、ある可変コレクションインスタンスa、インデックスi、そして値xに対して、以下のコード見本における２組の代入は同等なものでなければなりません：

source: That is, for any elements a, b, and c, the following conditions must hold:
ja: すなわち、何らかの要素a、b、そしてcに対して、以下の条件が保持されなければなりません：

source: That is, if source is negative, the result is padded with ones; otherwise, the result is padded with zeros.
ja: すなわち、sourceが負ならば、結果は１で詰め物をされます；そうでなければ、結果はゼロで詰め物をされます。

source: That kind of conversion is nonbreaking in other contexts, but would trigger a runtime error if the result of offset(of:) is force-unwrapped.
ja: その種の変換は、他の文脈においては非破壊です、しかしoffset(of:)の結果が強制アンラップされるならば実行時エラーの引き金となります。

source: That requirement holds even for empty ranges.
ja: その要件は空の範囲に対しても適用されます。

source: The 64-bit integer wrapped in a data value.
ja: あるデータ値の中にラップされる64ビット整数。

source: The &<<= operator performs a masking shift, where the value used as rhs is masked to produce a value in the range 0...bitWidth.
ja: &<<=演算子は、マスクするシフトを実行します、そこにおいてrhsとして使われる値はマスクされることで範囲0...bitWidthの中の値を生成します。

source: The &>>= operator performs a masking shift, where the value passed as rhs is masked to produce a value in the range 0...bitWidth.
ja: &>>=演算子は、マスクするシフトを実行します、そこにおいてrhsとして渡される値はマスクされることで範囲0...bitWidthの中の値を生成します。

source: The << operator performs a smart shift, which defines a result for a shift of any value.
ja: <<演算子は、ある賢いシフトを実行します、それは何らかの値のシフトに対する結果を定義します。

source: The >> operator performs a smart shift, which defines a result for a shift of any value.
ja: >>演算子は、ある賢いシフトを実行します、それは何らかの値のシフトに対する結果を定義します。

source: The >>= operator performs a smart shift, which defines a result for a shift of any value.
ja: >>=演算子は、ある賢いシフトを実行します、それは何らかの値のシフトに対する結果を定義します。

source: The ?? operator also works with another Optional instance on the right-hand side.
ja: ??演算子はまた、別のOptionalインスタンスを右手側でも扱います。

source: The Base (presumably non-lazy) sequence from which self was created.
ja: それからselfが作成されたBase（おそらく非遅延の）シーケンス。

source: The IteratorProtocol protocol is tightly linked with the Sequence protocol.
ja: IteratorProtocolプロトコルは、Sequenceプロトコルときつく結び付けられています。

source: The MutableCollection protocol allows changing the values of a collection’s elements but not the length of the collection itself.
ja: MutableCollectionプロトコルは、コレクションのもつ要素の値の変更を可能にします、しかしコレクション自体の長さはそうではありません。

source: The NS_ENUM macro is the only enumeration macro that results in an actual enumeration type when imported to Swift.
ja: NS_ENUMマクロは、Swiftにインポートされる場合に実際の列挙型という結果になるただ１つの列挙マクロです。

source: The Numeric protocol provides a suitable basis for arithmetic on scalar values, such as integers and floating-point numbers.
ja: Numericプロトコルは、例えば整数および浮動小数点数など、スカラー値に関する算術にふさわしい基礎を提供します。

source: The Optional type is an enumeration with two cases.
ja: Optional型は、２つのケース節を持つ列挙です。

source: The PlaygroundQuickLook protocol is deprecated, and will be removed from the standard library in a future Swift release.
ja: PlaygroundQuickLookプロトコルは推奨されません、そして将来のSwiftリリースで標準ライブラリから取り除かれるでしょう。

source: The RandomAccessCollection protocol adds further constraints on the associated Indices and SubSequence types, but otherwise imposes no additional requirements over the BidirectionalCollection protocol.
ja: RandomAccessCollectionプロトコルは、一層の制約を関連IndicesおよびSubSequence型に加えます、しかしそれ以外ではBidirectionalCollectionプロトコルを越える追加要件は課されません。

source: The RawRepresentable protocol is seen mainly in two categories of types: enumerations with raw value types and option sets.
ja: RawRepresentableプロトコルが主に見られるのは、２つの部類の型：列挙で生の値型を持つものとオプションセットにおいてです。

source: The SandwichPreferences class and its includesCrust property are renamed to Sandwich.Preferences and isCrusty for Swift:
ja: SandwichPreferencesクラスとそれのincludesCrustプロパティは、Sandwich.PreferencesとisCrustyへとSwiftのために改名されます：

source: The Sequence protocol makes no other requirements about element access, so routines that traverse a sequence should be considered O(n) unless documented otherwise.
ja: Sequenceプロトコルは要素アクセスについて他の要件を設けません、それでシーケンスを辿っていくおきまりの仕事はO(n)と考えるべきです、そうでないと文書化されるのでない限り。

source: The Sequence protocol makes no requirement on conforming types regarding whether they will be destructively consumed by iteration.
ja: Sequenceプロトコルは、準拠する型に関して、それらが反復によって破壊的に消費されることになるかについて要件を設けません。

source: The Sequence protocol provides default implementations for many common operations that depend on sequential access to a sequence’s values.
ja: Sequenceプロトコルは、シーケンスのもつ値への順次的なアクセスを頼りにするような多くの一般的な演算に対して省略時の実装を提供します。

source: The SignedNumeric protocol extends the operations defined by the Numeric protocol to include a value’s additive inverse.
ja: SignedNumericプロトコルは、Numericプロトコルによって定義される演算を拡張して、値の加法の逆元を含めるようにします。

source: The children collection of the resulting mirror may be upgraded to a random access collection later.
ja: 結果となるミラーのchildrenコレクションは、後にランダムアクセスコレクションにアップグレードされるかもしれません。

source: The fetchRemoteRandomNumber(completion:) method returns Void synchronously, and asynchronously calls a completion handler with a Result<Int, EntropyError> instance that contains either a random result or information about the failure.
ja: fetchRemoteRandomNumber(completion:)メソッドは、Voidを同期的に返します、そして非同期に完了ハンドラをResult<Int, EntropyError>インスタンスとともに呼び出します、それはある無作為な結果またはその失敗についての情報のどちらかを含みます。

source: The high component of the value carries the sign, if the type is signed.
ja: 値のhigh構成部分は符号を運びます、その型が符号付きならば。

source: The loggedIn and sessionExpired cases include the user as an associated value, while the unregistered case doesn't include an associated value.
ja: loggedInとsessionExpiredケース節はユーザを関連値として含みます、一方でunregisteredケース節は関連値を含みません。

source: The makeIterator() method returns another custom type, an iterator named CountdownIterator.
ja: makeIterator()メソッドは、別のあつらえの型、CountdownIteratorと名前をつけられるイテレータを返します。

source: The nextPartialResult closure is called sequentially with an accumulating value initialized to initialResult and each element of the sequence.
ja: nextPartialResultクロージャは、initialResultへと初期化された蓄積値とシーケンスの各要素とともに連続して呼び出されます。

source: The nextPartialResult closure is called with initialResult—0 in this case—and the first element of numbers, returning the sum: 1.
ja: nextPartialResultクロージャが、initialResult—この場合では0—そしてnumbersの最初の要素とともに呼び出されて、その合計：1を返します。

source: The now(_:) and later(_:) functions represent the two most common categories of APIs you'll encounter in methods from app frameworks that take closures: synchronous APIs like now(_:), and asynchronous APIs like later(_:).
ja: now(_:)とlater(_:)関数は、クロージャを取るアプリフレームワーク由来のメソッドにおいてあなたが出くわす、２つの最も一般的なAPIのカテゴリを表します：now(_:)のような同期的API、そしてlater(_:)のような非同期的API。

source: The nullable and nonnull annotations are simplified forms of the _Nullable and _Nonnull annotations, which you can use in almost any context that you would use the const keyword with a pointer type.
ja: nullableとnonnull注釈は、_Nullableと_Nonnull注釈の簡素化された形式です、それはあなたがconstキーワードをポインタ型とともに使うであろう、ほとんどあらゆる文脈で使用できます。

source: The numbers array is now arranged in two partitions.
ja: numbers配列は今や２つの区分に整頓されます。

source: The r1 range is bounded on the lower end by 0 because that is the starting index of the numbers array.
ja: r1範囲は、0によって下端に境界をつけられます、なぜならそれがnumbers配列の開始インデックスだからです。

source: The reduce1(_:) method makes certain kinds of sequence operations simpler.
ja: reduce1(_:)メソッドは、特定の種類のシーケンス演算をより簡単にします。

source: The reversed() method is always lazy when applied to a collection with bidirectional indices, but does not implicitly confer laziness on algorithms applied to its result.
ja: x.reversed()メソッドは、双方向性のインデックスを持つコレクションに適用される時は常に遅延です、しかしそれの結果に適用されるアルゴリズムに暗黙的に遅延性を授けることはしません。

source: The unsafelyUnwrapped property is recommended over calling the unsafeBitCast(_:) function because the property is more restrictive and because accessing the property still performs checking in debug builds.
ja: unsafelyUnwrappedプロパティは、unsafeBitCast(_:)関数呼び出し全般で推奨されます、なぜならこのプロパティはより制限的であるから、そしてこのプロパティにアクセスすることはデバッグビルドにおいて依然として確認を実行するからです。

source: The unsafelyUnwrapped property provides the same value as the forced unwrap operator (postfix !).
ja: unsafelyUnwrappedプロパティは、強制アンラップ演算子（後置!）と同じ値を提供します。

source: The updateAccumulatingResult closure is called sequentially with a mutable accumulating value initialized to initialResult and each element of the sequence.
ja: updateAccumulatingResultクロージャは、initialResultへと初期化された可変の蓄積値とシーケンスの各要素とともに連続して呼び出されます。

source: The updateAccumulatingResult closure is called with the initial accumulating value—[:] in this case—and the first character of letters, modifying the accumulating value by setting 1 for the key "a".
ja: updateAccumulatingResultクロージャが、初期蓄積値—この場合では[:]—そしてlettersの最初の文字とともに呼び出されて、1をキー"a"に対して設定することで蓄積値を修正します。

source: The CF_SWIFT_NAME macro is applied to each function, giving each one a new name for Swift that's nested together under the Color type:
ja: CF_SWIFT_NAMEマクロは各関数に適用されます、それぞれのものにColor型の下に一緒に入れ子にされるSwift用の新しい名前を与えます：

source: The makeIterator() method is provided as a default implementation.
ja: makeIterator()メソッドは、省略時の実装として提供されます。

source: The Countdown structure’s definition is short: It contains only the starting count and the makeIterator() method required by the Sequence protocol.
ja: Countdown構造体の定義は短いです：それはただ数え始めとSequenceプロトコルによって要求されるmakeIterator()メソッドだけを含みます。

source: The removeLast() method must be used only on a nonempty collection.
ja: removeLast()メソッドは、空でないコレクションでのみ使われるべきです。

source: The ..< operator creates a range that doesn’t include the upper bound, so it’s always safe to use with endIndex.
ja: ..<演算子は上方の境界を含まないある範囲を作成します、それでそれは常にendIndexと使うのに安全です。

source: The high and low properties of the result value represent 2000 when concatenated to form a double-width integer; that is, using result.high as the high byte and result.low as the low byte of a UInt16 instance.
ja: result値のhighおよびlowプロパティは、二倍幅整数に成形するために連結される時2000を表します；すなわち、UInt16インスタンスの高バイトとしてresult.highをそして低バイトとしてresult.lowを使って。

source: The user variable is nil when the user not logged in and has a value once the user logs in.
ja: user変数は、ユーザがログインしていない場合nilです、そして一旦ユーザがログインするならばある値を持ちます。

source: The CountdownIterator type keeps track of both the Countdown sequence that it’s iterating and the number of times it has returned a value.
ja: CountdownIterator型は、それが反復しているCountdownシーケンスそしてそれが値を返した回数の両方の情報を得続けます。

source: The KeyValuePairs instance preserves the order of the elements as passed.
ja: KeyValuePairsインスタンスは、要素の順番を渡された通りに保全します。

source: The high and low compnents of the result value represent -1920 when concatenated to form a double-width integer; that is, using result.high as the high byte and result.low as the low byte of an Int16 instance.
ja: result値のhighとlow構成要素は、２倍幅整数に成形するために連結される場合-1920を表します；すなわち、result.highを高バイトとしてresult.lowを低バイトとしてInt16インスタンスに使って。

source: The SetAlgebra protocol is specifically designed to accommodate both kinds of set.
ja: SetAlgebraプロトコルは、とりわけ両方の種類の集合に配慮するように設計されます。

source: The deinit of bufferClass must destroy its stored Header and any constructed Elements.
ja: bufferClassのdeinitは、それの格納したHeaderとあらゆる構成したElementそれらを破棄しなければなりません。

source: The sessionExpired variable begins as false and is set to true if the session expires.
ja: sessionExpired変数は、falseで始まります、そしてセッションが期限切れになるならばtrueに設定されます。

source: The ASCII representation of a number in the radix passed as radix.
ja: radixとして渡される基数におけるある数のASCII表現。

source: The ASCII representation of a number.
ja: ある数のASCII表現。

source: The Sendable protocol indicates that value of the given type can be safely used in concurrent code.
ja: Sendableプロトコルは、与えられた型の値が並行性コードにおいて安全に使用できることを指し示します。

source: The UnsafeSendable protocol indicates that value of the given type can be safely used in concurrent code, but disables some safety checking at the conformance site.
ja: UnsafeSendableプロトコルは、与えられた型の値が並行性コードにおいて安全に使用できる、しかしいくつかの安全検査を適応場所で作動しなくすることを指し示します

source: The absence of a value.
ja: ある値の不在。

source: The accessed slice uses the same indices for the same elements as the original collection uses.
ja: アクセスされるスライス（切り取り）は、同じ要素に対して元のコレクションが使うのと同じインデックスを使います。

source: The accessed slice uses the same indices for the same elements as the original collection.
ja: アクセスされるスライス（切り取り）は、同じ要素に対して元のコレクションと同じインデックスを使います。

source: The actual number of elements that can be stored in this object.
ja: このオブジェクトに格納できる要素の実際の数。

source: The addition operator (+) calculates the sum of its two arguments.
ja: 加算演算子（+）は、それの２つの引数の合計を計算します。

source: The additional initializer omits the label requirement for its first parameter:
ja: 追加的なイニシャライザは、それの最初のパラメータに対するラベル要件を省略します：

source: The additive inverse of the argument.
ja: この引数の加法の逆元。

source: The additive inverse of this value.
ja: この値の加法の逆元。

source: The algorithm used to create random values may change in a future version of Swift.
ja: 無作為値を作成するために使われるアルゴリズムは、将来のSwiftバージョンで変わるかもしれません。

source: The algorithm used to select a random element may change in a future version of Swift.
ja: ある無作為な要素を選択するために使われるアルゴリズムは、将来のSwiftバージョンで変わるかもしれません。

source: The algorithm used to shuffle a collection may change in a future version of Swift.
ja: あるコレクションをシャッフルするために使われるアルゴリズムは、将来のSwiftバージョンで変わるかもしれません。

source: The algorithm used to shuffle a sequence may change in a future version of Swift.
ja: あるシーケンスをシャッフルするために使われるアルゴリズムは、将来のSwiftバージョンで変更するかもしれません。

source: The argument you pass to the CF_SWIFT_NAME macro uses the same syntax as the #selector expression.
ja: あなたがCF_SWIFT_NAMEマクロに渡す引数は、#selector式と同じ構文を使います。

source: The array to append to.
ja: 追加先の配列。

source: The base state.
ja: 基底状態。

source: The behavior of incrementing indefinitely is determined by the type of Bound.
ja: 無限に漸増する挙動は、Boundの型によって決定されます。

source: The big-endian representation of this integer.
ja: この整数のビッグエンディアン表現。

source: The bit width of a Int64 instance is 64.
ja: Int64インスタンスのビット幅は64です。

source: The bit width of an Int8 instance is 8.
ja: Int8インスタンスのビット幅は８です。

source: The bitwise NOT operator (~) is a prefix operator that returns a value in which all the bits of its argument are flipped: Bits that are 1 in the argument are 0 in the result, and bits that are 0 in the argument are 1 in the result.
ja: ビット単位のNOT演算子（~）は前置演算子で、それの引数のビットすべてがひっくり返されるある値を返します：引数において1であるビットは結果において0になります、そして引数において0であるビットは結果において1になります。

source: The bounds of the range must be valid indices of the collection.
ja: この範囲の境界は、コレクションの有効なインデックスでなければなりません。

source: The bounds of the result are always limited to the bounds of limits.
ja: 結果の領域は、常にlimitsの領域に制限されます。

source: The call to animals.makeIterator() returns an instance of the array’s iterator.
ja: animals.makeIterator()への呼び出しは、配列のもつイテレータの１つのインスタンスを返します。

source: The call to firstIndex(where:) in the following example must traverse the whole collection to find the element that matches the predicate:
ja: firstIndex(where:)への呼び出しは以下の例において、コレクション全体を横断していき、述部に合致する要素を見つけます：

source: The children to use for the mirror.
ja: ミラーのために使う幾らかの子。

source: The class of the object used for storage.
ja: ストレージのために使われるオブジェクトのクラス。

source: The closure is called again repeatedly with the previous call’s return value and each element of the sequence.
ja: クロージャは、前の呼び出しの戻り値とシーケンスの各要素とともに繰り返して再び呼び出されます。

source: The closure is called again repeatedly with the updated accumulating value and each element of the sequence.
ja: クロージャは、更新された蓄積値とシーケンスの各要素とともに繰り返して再び呼び出されます。

source: The collection being appended to allocates any additional necessary storage to hold the new elements.
ja: コレクションは追加されることによって、新しい要素を保有するために何らかの追加的に必要なストレージを割り当てます。

source: The collection must not be empty.
ja: コレクションは空であってはなりません。

source: The collection to evaluate this range expression in relation to.
ja: このコレクションに関して、この範囲式を評価します。
